#Вступительные сообщения
greetings = 'Я бот "SecuTor", помогу тебе повысить свои знания в области кибербезопасности! \nЧтобы начать обучение, выбери нужный пункт, или введи /help для просмотра списка команд и пояснений к ним.'
unsignedMessage = 'Я тебя не понимаю, используй команды из /help.'
initialization = 'Секунду, инициализирую тебя...'
start_message = '\U00002B50 Начать!'

#Выбор функции
test = '\U0001F4CA Первичное тестирование'
regTraining = '\U0001F4DD Записаться на прохождение обучающего курса или удалить запись'
begin = '\U0001F4D5 Начать обучение'
user_info = '\U0001F465 Личный кабинет'

#Тренинг
regTrainingDialog= 'Расширение кругозора - это прекрасное занятие!\nВыбери тему, в которой хотел бы пройти тренинг:'

#Темы для тренингов
passwordsAndLogins = '\U0001F511 Пароли и учетные записи'
webAndInternet = '\U0001F310 Веб-сайты и интернет'
computerSafety = '\U0001F4BB Безопасность ПК'
backToMenu = '\U00002B05 Вернуться в главное меню'

#Помощь
helpString = '/start - начать работу бота; \n/help - получить список команд бота; \n/back - вернуться в главное меню; \n\n'+test+' - оценить свой уровень познаний в области кибербезопасности;\n'+regTraining+' - пройти обучающие курсы, которые не займут много времени и будут веселыми, интересными и позновательными; \n'+begin+' - здесь ты сможешь проверить и закрепить свои знания, тесты будут нетривиальными, и отражать ситуации из реальной жизни;'

#DataBase
userFound = '\U00002705 Успешно, теперь можно приступать к обучению!'
request_success = '\U00002705 Запрос успешно отправлен!'
request_decline = 'У вас уже есть активный запрос на тему '
delete_entry = '\U0000274C Удалить запрос'
succsessfuly_delete = 'Запрос удален.'

#Элементы личного кабинета пользователя
show_requests = '\U0001F4CB Показать мои записи на обучающие курсы'
show_info = '\U0001F4AC Показать общую информацию'
requests_found = 'Ты записан на следующие обучающие курсы:'
requests_not_found = 'У тебя ещё нет записей на обучающие курсы!'
user_info_text = 'вот основная информация по твоему профилю:\n\n'
completed_trainings = 'Пройдено курсов по теме '
info_completion = ' курсов.'
sertificate = '\U0001F393 Получить сертификат'

#Навигация
choice_item = 'Выбери нужную функцию \U00002935'

#Работа с сертификатами
course_passed = 'Отлично, вы прошли курс и можете получить сертификат!'
course_not_passed = 'К сожалению, доступных для выдачи сертификатов нет'