#Вступительные сообщения
greetings = 'Я бот "SecuTor", помогу тебе повысить свои знания в области кибербезопасности! \nЧтобы начать обучение, выбери нужный пункт, или введи /help для просмотра списка команд и пояснений к ним.'
unsignedMessage = 'Я тебя не понимаю, используй команды из /help.'
initialization = 'Секунду, инициализирую тебя...'
start_message = 'Начать!'

#Выбор функции
test = 'Первичное тестирование'
regTraining = 'Записаться на прохождение обучающего курса или удалить запись'
begin = 'Начать обучение'
user_info = 'Личный кабинет'

#Тренинг
regTrainingDialog= 'Расширение кругозора - это прекрасное занятие!\nВыбери тему, в которой хотел бы пройти тренинг:'

#Темы для тренингов
passwordsAndLogins = 'Пароли и учетные записи'
webAndInternet = 'Веб-сайты и интернет'
computerSafety = 'Безопасность ПК'
backToMenu = 'Вернуться в главное меню'

#Помощь
helpString = '/start - начать работу бота; \n/help - получить список команд бота; \n/back - вернуться в главное меню; \n\n'+test+' - оценить свой уровень познаний в области кибербезопасности;\n'+regTraining+' - пройти обучающие курсы, которые не займут много времени и будут веселыми, интересными и позновательными; \n'+begin+' - здесь ты сможешь проверить и закрепить свои знания, тесты будут нетривиальными, и отражать ситуации из реальной жизни;'

#DataBase
userFound = 'Успешно, теперь можно приступать к обучению!'
request_success = 'Запрос успешно отправлен!'
request_decline = 'У вас уже есть активный запрос на тему '
delete_entry = 'Удалить запрос'
succsessfuly_delete = 'Запрос удален.'

#Элементы личного кабинета пользователя
show_requests = 'Показать мои записи на обучающие курсы'
show_info = 'Показать общую информацию'
requests_found = 'Ты записан на следующие обучающие курсы:'
requests_not_found = 'У тебя ещё нет записей на обучающие курсы!'
user_info_text = 'вот основная информация по твоему профилю:\n\n'
completed_trainings = 'Пройдено курсов по теме '
info_completion = ' курсов.'

#Навигация
choice_item = 'Выбери нужную функцию:'